"""
1.1 Блок Ввода/вывода
"""


def inp_data(filename: str):
    """
    Функция считывания данных из файла.
    :param filename: имя файла, из которого считывается исходная символьная цепочка
    :return: исходная символьная цепочка
    """
    chain = ""
    return chain


def out_data(filename: str, result: str):
    """
    Функция выведения данных в файл.
    :param filename: имя файла, в который выводится результат работы распознавателя
    :param result: результат работы распознавателя
    :return:
    """
    pass
