"""
1.3 Лексический блок
"""


def to_lexemes(chain_characters: list):
    """
    Преобразует цепочку лексем, полученную от транслитератора,
    в цепочку лексем вида ("символ входного языка", "класс символа входного языка").
    :param chain_characters:список, каждый элемент которого представляет кортеж
                            вида ("символ цепочки", "класс символа цепочки ")
    :return:цепочка лексем: список, каждый элемент которого представляет кортеж
            вида ("символ входного языка", "класс символа входного языка")
    """
    chain_lexemes = []
    return chain_lexemes
