import unittest

from transl_unit import transliteration


class TransliterationTests(unittest.TestCase):
    def test_letters(self):
        self.assertEqual(transliteration("abcdefghijklmnopqrstuvwxyz"), [['a', 'буква'],
                                                                         ['b', 'буква'],
                                                                         ['c', 'буква'],
                                                                         ['d', 'буква'],
                                                                         ['e', 'буква'],
                                                                         ['f', 'буква'],
                                                                         ['g', 'буква'],
                                                                         ['h', 'буква'],
                                                                         ['i', 'буква'],
                                                                         ['j', 'буква'],
                                                                         ['k', 'буква'],
                                                                         ['l', 'буква'],
                                                                         ['m', 'буква'],
                                                                         ['n', 'буква'],
                                                                         ['o', 'буква'],
                                                                         ['p', 'буква'],
                                                                         ['q', 'буква'],
                                                                         ['r', 'буква'],
                                                                         ['s', 'буква'],
                                                                         ['t', 'буква'],
                                                                         ['u', 'буква'],
                                                                         ['v', 'буква'],
                                                                         ['w', 'буква'],
                                                                         ['x', 'буква'],
                                                                         ['y', 'буква'],
                                                                         ['z', 'буква']])

    def test_digits(self):
        self.assertEqual(transliteration("0123456789"), [['0', 'цифра'],
                                                         ['1', 'цифра'],
                                                         ['2', 'цифра'],
                                                         ['3', 'цифра'],
                                                         ['4', 'цифра'],
                                                         ['5', 'цифра'],
                                                         ['6', 'цифра'],
                                                         ['7', 'цифра'],
                                                         ['8', 'цифра'],
                                                         ['9', 'цифра']])

    def test_symbols(self):
        self.assertEqual(transliteration("=[];+-*/. "), [['=', 'равно'],
                                                         ['[', 'лвскобка'],
                                                         [']', 'прскобка'],
                                                         [';', 'тчкзпт'],
                                                         ['+', 'знак'],
                                                         ['-', 'знак'],
                                                         ['*', 'бинзнак'],
                                                         ['/', 'бинзнак'],
                                                         ['.', 'тчк'],
                                                         [' ', 'пробел']])

    def test_chain(self):
        self.assertEqual(transliteration("type arr = array [-1/min..+1*max] of char; "), [['t', 'буква'],
                                                                                          ['y', 'буква'],
                                                                                          ['p', 'буква'],
                                                                                          ['e', 'буква'],
                                                                                          [' ', 'пробел'],
                                                                                          ['a', 'буква'],
                                                                                          ['r', 'буква'],
                                                                                          ['r', 'буква'],
                                                                                          [' ', 'пробел'],
                                                                                          ['=', 'равно'],
                                                                                          [' ', 'пробел'],
                                                                                          ['a', 'буква'],
                                                                                          ['r', 'буква'],
                                                                                          ['r', 'буква'],
                                                                                          ['a', 'буква'],
                                                                                          ['y', 'буква'],
                                                                                          [' ', 'пробел'],
                                                                                          ['[', 'лвскобка'],
                                                                                          ['-', 'знак'],
                                                                                          ['1', 'цифра'],
                                                                                          ['/', 'бинзнак'],
                                                                                          ['m', 'буква'],
                                                                                          ['i', 'буква'],
                                                                                          ['n', 'буква'],
                                                                                          ['.', 'тчк'],
                                                                                          ['.', 'тчк'],
                                                                                          ['+', 'знак'],
                                                                                          ['1', 'цифра'],
                                                                                          ['*', 'бинзнак'],
                                                                                          ['m', 'буква'],
                                                                                          ['a', 'буква'],
                                                                                          ['x', 'буква'],
                                                                                          [']', 'прскобка'],
                                                                                          [' ', 'пробел'],
                                                                                          ['o', 'буква'],
                                                                                          ['f', 'буква'],
                                                                                          [' ', 'пробел'],
                                                                                          ['c', 'буква'],
                                                                                          ['h', 'буква'],
                                                                                          ['a', 'буква'],
                                                                                          ['r', 'буква'],
                                                                                          [';', 'тчкзпт'],
                                                                                          [' ', 'пробел']])

    def test_KeyError(self):
        self.assertRaises(KeyError, transliteration, "%")


if __name__ == '__main__':
    unittest.main()
