"""
1.2 Блок транслитерации
"""


def transliteration(chain: str):
    """
    Получает исходную символьную цепочку. Преобразует исходную символьную цепочку
    в цепочку лексем вида ("символ цепочки", "класс символа цепочки ").
    Классы символов цепочки: буква, цифра, пробел, плюс, минус, умножить, тчкзпт.
    :param chain: исходная символьная цепочка
    :return: список, каждый элемент которого представляет кортеж
            вида ("символ цепочки", "класс символа цепочки ")
    """
    chain_characters = []
    return chain_characters
