"""
2.1 Блок идентификации ключевых слов
"""


def identify(identifier: str):
    """
    Устанавливает, какому из ключевых слов языка Pascal соответствует заданный идентификатор.
    :param identifier:идентификатор, по которому следует установить соответствие ключевому слову языка Pascal.
    :return: В случае, если идентификатор совпадает с ключевым словом Pascal,
    возвращает строку “КЛСЛОВО_<ИДЕНТИФИКАТОР>”, где на месте <ИДЕНТИФИКАТОР> находится identifier.
    В ином случае, возвращает identifier.

    """
    processed_identifier = ""
    return processed_identifier
